Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །བདག་གིས་ཀྱང་སྲོག་གཅོད་པ་སྤང་བར་བྱ་ཞེས་བྱ་བ་ནས་དམ་པའི་ཆོས་གནས་པ་མཐུན་པས་དགའ་བར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པའོ།
en: And the fully complete practice is from “I must also stop killing,” up to “the good doctrine lasts, welcoming it.”

source: །དེའི་འོག་ཏུ་སྦྱོར་བའི་འབྲས་བུ་རྣམ་པ་གཉིས་ཏེ། སྒྲིབ་པ་མེད་པ་དང་། ཡོངས་སུ་འཛིན་པ་མེད་པའོ།
en: Then there are the two results from the practice: the absence of obscuration and the absence of seizing.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་བསྐྱེད་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་དབང་གིས་སོ།
en: The “I must produce a balanced thought toward all beings” is from the perspective of the suchness of all dharmas. “

source: །གཟུགས་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སྒྲིབ་པར་མི་རྟོག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Form will be without obscuration” means they do not obscure or conceptualize form. “

source: །སྔོན་གྱི་མཐའ་ནས་ཀྱང་གཟུགས་ཡོངས་སུ་མ་བཟུང་ངོ་ཞེས་བྱ་བ་ནི་སྔོན་གྱི་དུས་ནས་ཀྱང་གཟུགས་ལ་ལོགས་པའི་སྒྲིབ་པར་འགྱུར་བ་ཡོངས་སུ་མི་གཟུང་ངོ་།
en: Even in the past… did not seize form.” Even in times past there was no obscuration of form and so on and they did not seize it.

source: །དེ་ལྟར་ཡོངས་སུ་མ་བཟུང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལ།
en: Having said “it is because they did not seize,” and so on, it then says, “and why?”

source: ཇི་ལྟར་གཟུགས་ཡོངས་སུ་མ་བཟུང་བ་ཞེས་བྱ་བར་འགྱུར་ཞེ་ན་ཞེས་བྱ་བ་ནི་ཐེ་ཚོམ་ཟ་བ་རྣམས་ཀྱི་ཕྱིར་གསུངས་སོ།
en: asking, for the sake of those who are uncertain, how they “did not seize form” and so on. “

source: །རབ་འབྱོར་འདི་ལྟར་གཟུགས་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་ཉིད་འཕེལ་བར་བྱེད་ཀྱི་ཡོངས་སུ་འཛིན་པ་ནི་མ་ཡིན་ནོ།
en: Because even that form that has not been seized, Subhūti, is not form.” Bodhisattvas cause just not seizing on all dharmas to get stronger, not seizing.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་མི་འཛིན་པ་དེ་ཡང་གཟུགས་ལ་སོགས་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ།
en: But even that which bodhisattvas do not seize is not the intrinsic nature of form and so on.

source: །དེ་བས་ན་ཡོངས་སུ་འཛིན་པ་མེད་པ་སྤེལ་ན་བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ལ་སོགས་པ་ཡོངས་སུ་མ་བཟུང་བར་འགྱུར་རོ།
en: Therefore, when not seizing has gotten stronger, form and so on will not be seized on by bodhisattvas.

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་སྔར་དོན་དམ་པར་ཕྱིར་ལྡོག་པ་ཡང་མེད་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པ་གསུམ་ཡང་མེད་དོ་ཞེས་སྨྲས་པའི་ཕྱིར་དེ་ནི་སྐབས་འདིར་ཕྱིར་མི་ལྡོག་པའི་རྟགས་རྣམས་ཞུས་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱིར་མི་ལྡོག་པའི་རྟགས་རྣམ་པ་སུམ་ཅུ་རྩ་ལྔས་བསྟན་ཏེ། དེ་བཞིན་ཉིད་ལ་གཉིས་སུ་མེད་པར་མཐོང་བ་དང་། ཐམས་ཅད་ལས་ཕྱིར་ལྡོག་པ་དང་། སྟོན་པ་གཞན་ལ་རིམ་གྲོ་བྱེད་པ་ལ་སོགས་པ་ཆོས་ངན་པ་མེད་པ་དང་། མི་ཁོམ་པར་སྐྱེ་བ་མེད་པ་དང་། མི་དགེ་བའི་ལས་ཀྱི་ལམ་སྤངས་པ་དང་། དགེ་བའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་གསུང་རབ་ཡན་ལག་བཅུ་གཉིས་ཀྱི་ཆོས་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཆོས་ཟབ་མོ་ལ་ནེམ་ནུར་མེད་པ་དང་། ལུས་ངག་དང་། ཡིད་ཀྱི་ལས་འཇམ་ཞིང་བྱམས་པར་ལྡན་པ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་དང་དུ་མི་ལེན་པ་དང་། བག་ལ་ཉལ་བ་རྣམ་པ་བདུན་མེད་པ་དང་། དྲན་པ་དང་ཤེས་བཞིན་དུ་ལྡན་པའི་སྤྱོད་ལམ་ཅན་དང་། གཙང་སྦྲར་སྤྱོད་པ་ལ་སོགས་པ་དང་ལྡན་པ་དང་། ལུས་ལ་སྲིན་བུའི་རིགས་སྟོང་མི་འབྱུང་བ་དང་། ལུས་དང་ངག་དང་སེམས་ཡོངས་སུ་དག་པ་དང་། འདོད་པ་ཆུང་ལ་ཆོག་ཤེས་ཤིང་སྦྱངས་པའི་ཡོན་ཏན་ལ་བརྟེན་པ་དང་། སེར་སྣ་ལ་སོགས་པ་མེད་པ་དང་། བློ་བརྟན་ཞིང་ཟབ་པ་ལ་སོགས་པ་དང་ལྡན་པ་དང་། བདུད་ལ་སོགས་པས་མི་འཕྲོགས་པ་དང་། དྲིང་མི་འཇོག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་པ་དང་། བདུད་ཀྱི་ལས་རྟོགས་པ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་དང་། ཕྱིར་ལྡོག་པ་དང་ཕྱིར་མི་ལྡོག་པ་དང་། བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་འབྲས་བུ་ལ་མི་རེག་པ་དང་། གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ལྷུར་མི་ལེན་པ་དང་།
en: Signs of bodhisattvas irreversible from progress toward awakening Then, because the elder Subhūti has earlier said that ultimately even turning back does not exist, and the three types of bodhisattva do not exist either, here, in this part of the text, he asks about the signs that they are irreversible from progress toward awakening.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་སྦྱོར་བ་རྣམ་པ་བཞི་ཕུན་སུམ་ཚོགས་པ་དང་། སྦྱིན་པའི་འབྲས་བུ་གཞན་མི་དགའ་བར་འགྱུར་བ་ལ་སོགས་པ་ལ་མི་རེ་བ་དང་། རྡོ་རྗེའི་རིགས་ལྔ་ཕྱི་བཞིན་འབྲང་བ་ལ་སོགས་པའི་དབང་དང་། སྔགས་དང་བཟོ་ངན་པ་ལ་མི་བརྟེན་པ་དང་། གཏམ་ངན་པའི་སྦྱོར་བ་ལས་ལྡོག་ཅིང་ཡང་དག་པའི་ལས་དང་བསམ་པ་ལ་འཇུག་པ་དང་།
en: Then the Lord gives an explanation of thirty-five signs: because irreversible bodhisattvas see without duality in suchness;have turned away from all; do not honor and so on other teachers or have a doctrine that is not inferior;are not born in a place that precludes a perfect human birth;stop the ten unwholesome actions;complete the ten wholesome actions;complete all the perfections for the sake of all beings;study the doctrine—the twelve branches of the sacred word—for the sake of all beings;are not unsure about the deep dharmas;are endowed with gentle and loving physical, verbal, and thinking-mind actions;do not put up with the five obscurations;do not have the seven bad proclivities;act with mindfulness and a clear awareness of what they are doing;are habitually clean and so on;are those bodhisattvas in whom the thousands of maggot families do not arise;have a pure body, pure speech, and a pure mind;are not needy, are content, and rely on the qualities of the ascetic;are not miserly and so on;have a steady, profound intellect and so on;are not stolen away by Māra and so on;do not repose their confidence in others;rely on the perfection of wisdom;comprehend the works of Māra;have gained forbearance for the nonproduction of dharmas;have turned back and are irreversible from progress toward awakening;are not affected by the results of the concentrations, meditative stabilizations, or absorptions; do not focus on all dharmas, form and so on;have the perfect four practices of the perfections;do not hope the result of giving is that others become distressed and so on;have the faculties such that the five vajra families are always shadowing them and so on;do not resort to spells and base arts;stop being preoccupied with base stories and engage in perfect deeds and aspirations;harbor no doubt about their own level;will give up even their life to look after the doctrine; anddo not lose the doctrines they have taken up.

source: རང་གི་ས་ལ་ཐེ་ཚོམ་མེད་པ་དང་། ཆོས་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་སྲོག་ཀྱང་ཡོངས་སུ་གཏོང་བ་དང་། ཆོས་བཟུང་བ་རྣམས་ཆུད་མི་གསོན་པའི་ཕྱིར་རོ།
en: Among them, “in regard to those suchnesses, they have no doubt at all that they are not each separate and both.”

source: །དེ་ལ་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་རེ་རེ་དང་གཉིས་ཀ་མ་ཡིན་པར་ཐེ་ཚོམ་ཟ་བ་གང་ཡང་མེད་དོ་ཞེས་བྱ་བས་ནི་གང་ཟག་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་དབང་གིས་དེ་བཞིན་གཤེགས་པ་གཅིག་པ་ཉིད་དུ་སྟོན་ཏེ།
en: This is explaining, based on the suchness of all persons, that the tathāgatas are exactly the same.

source: །ངོ་བོ་ཉིད་དམ་གཉི་གའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means the intrinsic nature, or the intrinsic nature of both, is not the intrinsic nature of suchness. “

source: །ཆོས་ཐམས་ཅད་ནི་རྣམ་པ་མེད་པ་མཚན་མ་མེད་པ་རྟགས་མེད་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ལ་རྣམ་པ་མེད་པའི་ཕྱིར་རོ།
en: All dharmas are without attributes, without tokens, and without signs” because suchness has no attributes. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རྣམ་པ་མ་མཆིས་པ་ལགས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་སྟོན་ཏེ། གལ་ཏེ་རྣམ་པ་མེད་ཅིང་མཚན་མ་མེད་ན། ཇི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་རྣམ་པ་དང་མཚན་མ་བཤད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Lord, if all dharmas are without attributes,” and so on, means that if you say there are no attributes and no signs how have you explained the attributes and signs of those who are irreversible from progress toward awakening? “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཟུགས་ལས་ཕྱིར་ལྡོག་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་རྣམ་པ་མེད་པར་ཤེས་པ་ཉིད་རྟགས་ཡིན་ནོ་ཞེས་སྟོན་ཏེ།
en: Subhūti… bodhisattva great beings who have turned away from form,” and so on, is teaching that just the knowledge, in the absence of the attribute, is the reason they are irreversible from progress toward awakening.

source: གཟུགས་ཀྱི་རྣམ་པ་དང་། གཟུགས་ཀྱི་རྟགས་ལས་ཕྱིར་ལྡོག་པ་ཞེས་བྱའོ།
en: They have “turned away from” an attribute of form, from what is a token of form. “

source: །ཤེས་པར་བྱ་བ་ཤེས་པའོ་ཞེས་བྱ་བ་ནི་ཤེས་བྱ་ཤེས་པའོ། །བལྟ་བར་བྱ་བ་མཐོང་བའོ་ཞེས་བྱ་བ་ནི་ལྟ་བ་མཐོང་བའོ།
en: Know what needs to be known”— know the knowable; “see what needs to be seen”— see what needs to be looked at. “

source: །ངོ་མཚར་དང་བཀྲ་ཤིས་ཀྱིས་དག་པར་མི་འཛིན་ཞེས་བྱ་བ་ལ་བཀྲ་ཤིས་དང་ངོ་མཚར་གྱི་བཀྲ་ཤིས་ནི་བསམས་པ་ཙམ་གྱིས་བྱས་པ་སྟེ།
en: They do not hold that a spectacle or an auspicious sign makes for cleanliness.”

source: ཁྲུས་དང་སྨྱུང་བར་འདུག་པ་དང་མངོན་པར་འཇུག་པ་དང་མུ་སྟེགས་དང་། མཆོད་སྦྱིན་ལ་སོགས་པས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: An auspicious spectacle or auspicious sign means that just because they think so, [purification] has been done by bathing, fasting, chanting, visiting holy places, ceremonial offerings, and so on.

source: །ཕྱིར་མི་ལྡོག་པའི་མཚན་མ་ཐམས་ཅད་ནི་བརྡ་ཕྲད་སླའོ།
en: The explanation of all the tokens of irreversibility is easy.

source: །ས་དང་པོ་ཐོབ་པ་ཉིད་ཀྱིས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་མོད་ཀྱི་འོན་ཀྱང་ས་བརྒྱད་པ་ལ་ཕྱིར་ལྡོག་པར་འགྱུར་བ་གཉིས་པ་ཡང་བསྟན་ཏོ།
en: It is true that not turning back from progress toward full awakening happens just by reaching the first level, but it also teaches a second not turning back from progress toward full awakening that happens at the eighth level.

source: །ཕྱིར་ལྡོག་པ་དང་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱ་བ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཕྱིར་ལྡོག་པས་ཕྱིར་ལྡོག་པའོ། །སངས་རྒྱས་ཀྱི་ས་ལས་ཕྱིར་མི་ལྡོག་པས་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ།
en: As for those who “turn back” and are “irreversible,” those who turn back from the śrāvaka and pratyekabuddha levels “turn back”; those who do not turn back from the Buddha level are “irreversible from progress toward full awakening.”

source: །དེ་ལྟར་ཕྱིར་མི་ལྡོག་པའི་ཡོན་ཏན་རྣམས་ཐོས་ནས་ཕྱིར་མི་ལྡོག་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དོན་དུ་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཟབ་ཅིང་ཟབ་པའི་གནས་རྣམས་ཞུས་པ། བཅོམ་ལྡན་འདས་གནས་ཟབ་མོ་རྣམས་ལེགས་པར་བསྟན་དུ་གསོལ་ཞེས་བྱའོ།
en: Part Two Subhūti’s Two Hundred and Seventy-Seven Questions Having thus heard about the good qualities of irreversible bodhisattvas not turning back, the elder Subhūti asks about the deep places for the benefit of bodhisattvas who want to be irreversible from progress toward full awakening and says “would that you might also well expound those deep places.”

source: །འདི་མན་ཆད་ནི་གནས་བརྟན་རབ་འབྱོར་གྱིས་ཞུ་བ་ཉིས་བརྒྱ་བདུན་ཅུ་རྩ་བདུན་གྱིས་ཟབ་མོའི་གནས་ཞུས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ལན་གླན་པ་འབྱུང་སྟེ།
en: From here on the elder Subhūti asks two hundred and seventy-seven questions about the deep places and the Lord provides the responses.

source: དེ་ལ་བཅོམ་ལྡན་འདས་གནས་ཟབ་མོ་ཟབ་མོ་རྣམས་ལེགས་པར་བསྟན་དུ་གསོལ་ཞེས་བྱ་བ་ནི་ཞུས་པ་དང་པོའོ།
en: The first is “would that you might also well expound those deep places.”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་དེ་མྱ་ངན་ལས་འདས་པའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སུ་བས་ཀྱི། ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}མ་ལགས་སམ་ཞེས་བྱ་བ་ནི་གཉིས་པའོ།
en: The second is, “Lord, are they words only for nirvāṇa or are they words for all dharmas?”

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་གསུམ་པའོ།
en: and so on. The third is, “Lord, what is the suchness of form like?” and so on.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་མངོན་པར་འདུ་བགྱིད་པ་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པའོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བཞི་པའོ།
en: The fourth is, “The Lord has said, ‘Whatever merit has been accumulated it is all imaginary,’ so how will a son of a good family or daughter of a good family make a lot of merit?”

source: །བཅོམ་ལྡན་འདས་གྲངས་མ་མཆིས་པ་དང་དཔག་ཏུ་མ་མཆིས་པ་དང་ཚད་མ་མཆིས་པ་ལ་བྱེ་བྲག་ནི་ཅི་ཞིག་མཆིས་ཞེས་བྱ་བ་ནི་ལྔ་པའོ།
en: and so on. The fifth is, “Lord, what are the specific features of incalculable, infinite, and immeasurable?”

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་གང་གིས་གཟུགས་ཀྱང་གྲངས་མ་མཆིས་པར་འགྱུར་བ་དེ་ལྟ་བུ་མཆིས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དྲུག་པའོ།
en: and so on. The sixth is, “Lord, would there also be a way such that form would also be incalculable?” and so on.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་གཟུགས་འབའ་ཞིག་སྟོང་དུ་བས་ཀྱི་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བདུན་པའོ།
en: The seventh is, “Lord, is it just that form is empty?” and so on.

source: །བཅོམ་ལྡན་འདས་བརྗོད་དུ་མ་མཆིས་པའི་དོན་ལ་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་སམ་ཞེས་བྱ་བ་ནི་བརྒྱད་པའོ།
en: The eighth is, “Lord, does an inexpressible reality know increase or decrease?” and so on.

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་བརྗོད་དུ་མ་མཆིས་པའི་དོན་ལ་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་ན་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་དགུ་པའོ།
en: The ninth is, “Lord, if an inexpressible reality does not increase or decrease, will the perfection of giving, Lord, not increase or decrease?”

source: །བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་བཅུ་པའོ།
en: and so on. The tenth is, “Lord, what is unsurpassed, perfect, complete awakening?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བུ་ཞིག་ཅེས་བྱ་བ་ནི་བཅུ་གཅིག་པའོ།
en: The eleventh is, “What is the suchness of all phenomena?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་སེམས་དང་པོ་བསྐྱེད་པས་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བཅུ་གཉིས་པའོ།
en: The twelfth is, “Lord, do bodhisattva great beings fully awaken to unsurpassed, perfect, complete awakening because of the first production of the thought?” and so on.

source: །བཅོམ་ལྡན་འདས་བཅུ་པོ་གང་དག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་བཅུ་གསུམ་པའོ།
en: The thirteenth is, “Lord, do bodhisattva great beings, having completed all the ten levels, fully awaken to unsurpassed, perfect, complete awakening?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཏིང་ངེ་འཛིན་གསུམ་ལ་སྙོམས་པར་འཇུག་ཅིང་ཞེས་བྱ་བ་ནི་བཅུ་བཞི་པའོ།
en: and so on. The fourteenth is, “How, Lord, when they do so, will bodhisattva great beings become absorbed for the sake of beings in the three meditative stabilizations?”

source: །ཇི་ལྟར་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱིད་ཅིང་ཞེས་བྱ་བ་ནི་བཅོ་ལྔ་པའོ།
en: The fifteenth is, “How do bodhisattva great beings complete the perfection of wisdom?”

source: །ཇི་ལྟར་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་བགྱི་ཞེས་བྱ་བ་ནི་བཅུ་དྲུག་པའོ།
en: The sixteenth is, “How do bodhisattva great beings fully master emptiness?”

source: །ཇི་ལྟར་ན་སྟོང་པ་ཉིད་ལ་གནས་ལ་སྟོང་པ་ཉིད་མངོན་སུམ་དུ་ཡང་མི་བགྱིད་པ་ལགས་ཞེས་བྱ་བ་ནི་བཅུ་བདུན་པའོ།
en: The seventeenth is, “How do bodhisattva great beings stand in emptiness but not actualize emptiness?”

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཚན་ཉིད་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་བཅོ་བརྒྱད་པའོ།
en: The eighteenth is, “Lord, what is the mark of the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་པ་ལ་ཞེས་བྱ་བ་ནི་བཅུ་དགུ་པའོ།
en: The nineteenth is, “Lord, if all phenomena are isolated from all phenomena and if all phenomena are empty of all phenomena, Lord, how could there be the defilement and purification of beings?”

source: །བཅོམ་ལྡན་འདས་ཡིད་ལ་བགྱི་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་བཞིན་དང་བྲལ་བ་སྟེ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་པའོ།
en: The twentieth is, “Lord, given that all attention is separated from an intrinsic nature, that all attention is empty of an intrinsic nature, how, Lord, are bodhisattva great beings never separated from attention connected to the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་བཞིན་གྱིས་དབེན་ཞིང་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་གཅིག་པའོ།
en: The twenty-first is, “Lord, given that the perfection of wisdom is separated from an intrinsic nature, how will bodhisattva great beings succeed at the perfection of wisdom and fully awaken to unsurpassed, perfect, complete awakening?”

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོང་པ་ཉིད་དང་གསོག་ཉིད་དང་གསོབ་ཉིད་ཅེས་བྱ་བ་ནི་ཉི་ཤུ་གཉིས་པའོ།
en: The twenty-second is, “Lord, is it the emptiness of the perfection of wisdom, its state of ringing hollow, being in vain [that practices the perfection of wisdom]?”

source: །སྐབས་འདིར་བར་སྐབས་སུ་ཞུས་པ་བཅུའོ།
en: At this point there is a subsection with ten questions.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཆོས་ཐམས་ཅད་སྐྱེ་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རམ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་གསུམ་པའོ།
en: The twenty-third is, “Lord, is the bodhisattvas’ unsurpassed, perfect, complete awakening prophesied because there will be the production of all the dharmas?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཉམ་པ་ཉིད་གང་ལགས་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བཞི་པའོ།
en: The twenty-fourth is, “Lord, what is the sameness of bodhisattva great beings?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་གཟུགས་བས་པར་བགྱི་བའི་སླད་དུ་སློབ་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སློབ་པ་ལགས་སམ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་ལྔ་པའོ།
en: The twenty-fifth is, “Lord, when bodhisattva great beings train to put an end to form do they train in the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་དྲུག་པའོ།
en: The twenty-sixth is, “Lord, if all dharmas are in their basic nature perfectly pure, what dharma’s perfect purity do bodhisattva great beings attain?”

source: །བཅོམ་ལྡན་འདས་ཅི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཕུན་སུམ་ཚོགས་པ་ཡང་དེས་ཐོབ་པར་བགྱི་འམ་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བདུན་པའོ།
en: The twenty-seventh is, “Lord, do they even have to obtain a śrāvaka’s and a pratyekabuddha’s perfect state?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་སྒྱུ་མ་ལྟ་བུའི་སེམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་བརྒྱད་པའོ།
en: The twenty-eighth is, “Lord, in what way will a thought that is like an illusion fully awaken to unsurpassed, perfect, complete awakening?”

source: །ཇི་ལྟར་ན་དབེན་པས་དབེན་པ་རྗེས་སུ་རྟོགས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ཉི་ཤུ་དགུ་པའོ།
en: The twenty-ninth is, “How will there be a realization of the isolated by the isolated?”

source: །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སླར་ལྡོག་པ་འམ། སླར་མི་ལྡོག་པ་གང་དག་གི་མིང་ཡོངས་སུ་བརྗོད་ཅིང་དགའ་བའི་ཚུལ་གྱིས་ཆོས་སྟོན་པར་མཛད་ཅེས་བྱ་བ་ནི་སུམ་ཅུ་པའོ།
en: The thirtieth is, “Lord, do those lord buddhas teach the Dharma in the form of a proclamation of the names of those bodhisattva great beings who turn back or those who do not turn back?”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་ཉིད་དུ་གནས་ནས་དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བགྱིས་ཏེ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གཅིག་པའོ།
en: The thirty-first is, “Lord, given that no phenomenon is apprehended when they have stood in suchness and practiced for suchness, how will they stand in the knowledge of all aspects?”

source: །བཅོམ་ལྡན་འདས་གང་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ཞེས་བགྱི་བ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གཉིས་པའོ།
en: The thirty-second is, “Lord, given that no dharma called ‘a tathāgata’s magical creation’ is apprehended at all, who will stand in suchness?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་གསུམ་པའོ།
en: The thirty-third is, “Lord, how are they to accomplish the perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བཞི་པའོ།
en: The thirty-fourth is, “Lord, how does the perfection of giving reach completion in bodhisattva great beings practicing this perfection of wisdom?”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་ལྔ་པའོ།
en: The thirty-fifth is, “How do bodhisattva great beings standing in the perfection of giving incorporate the perfection of morality?”

source: །ཇི་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་དྲུག་པའོ།
en: The thirty-sixth is, “How do they, standing in the perfection of giving, incorporate the perfection of patience?”

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བདུན་པའོ།
en: The thirty-seventh is, “How the perfection of perseverance?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་བརྒྱད་པའོ།
en: The thirty-eighth is, “How the perfection of concentration?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སུམ་ཅུ་དགུ་པའོ།
en: The thirty-ninth is, “How the perfection of wisdom?”

source: །ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་པའོ།
en: The fortieth is, “How do they, standing in the perfection of morality, incorporate the perfection of giving?”

source: །ཇི་ལྟར་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གཅིག་པའོ།
en: The forty-first is, “How the perfection of patience?”

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གཉིས་པའོ།
en: The forty-second is, “How the perfection of perseverance?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་གསུམ་པའོ།
en: The forty-third is, “How the perfection of concentration?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བཞི་པའོ།
en: The forty-fourth is, “How the perfection of wisdom?”

source: །ཇི་ལྟར་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་ལྔ་པའོ།
en: The forty-fifth is, “How do they, standing in the perfection of patience, incorporate the perfection of giving?”

source: །ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་དྲུག་པའོ།
en: The forty-sixth is, “How the perfection of morality?”

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བདུན་པའོ།
en: The forty-seventh is, “How the perfection of perseverance?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་བརྒྱད་པའོ།
en: The forty-eighth is, “How the perfection of concentration?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་བཞི་བཅུ་དགུ་པའོ།
en: The forty-ninth is, “How the perfection of wisdom?”

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་པའོ།
en: The fiftieth is, “How do they, standing in the perfection of perseverance, incorporate the perfection of giving?”

source: །ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཅིག་པའོ།
en: The fifty-first is, “How the perfection of morality?”

source: །ཇི་ལྟར་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཉིས་པའོ།
en: The fifty-second is, “How the perfection of patience?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གསུམ་པའོ།
en: The fifty-third is, “How the perfection of concentration?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བཞི་པའོ།
en: The fifty-fourth is, “How the perfection of wisdom?”

source: །ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་ལྔ་པའོ།
en: The fifty-fifth is, “How do they, standing in the perfection of concentration, incorporate the perfection of giving?”

source: །ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་དྲུག་པའོ།
en: The fifty-sixth is, “How the perfection of morality?”

source: །ཇི་ལྟར་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བདུན་པའོ།
en: The fifty-seventh is, “How the perfection of patience?”

source: །ཇི་ལྟར་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བརྒྱད་པའོ།
en: The fifty-eighth is, “How the perfection of perseverance?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་དགུ་པའོ།
en: The fifty-ninth is, “How the perfection of wisdom?”

source: །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་པའོ།
en: The sixtieth is, “How do they, standing in the perfection of wisdom, incorporate the perfection of giving?”

source: །ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གཅིག་པའོ།
en: The sixty-first is, “How the perfection of morality?”

source: །ཇི་ལྟར་ན་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གཉིས་པའོ།
en: The sixty-second is, “How the perfection of patience?”
